In [2]:
import pandas as pd

In [3]:
# 판다스 자료구조

# Series - 딕셔너리
# DataFrame - 표

a = pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])
print(a)
print(a.index)

a    1
b    2
c    3
d    4
dtype: int64
Index(['a', 'b', 'c', 'd'], dtype='object')

- 판다스에서 데이터프레임 만들기
    - 판다스에서 지원하는 DataFrame 함수로 데이터프레임 생성

In [4]:
data = {'name' : ['Mark','Jane','Chris','Ryan'],
       'age': [33, 32, 44, 42],
       'score': [91.3, 83.4, 77.5, 87.7]}

df = pd.DataFrame(data)
print(df)

    name  age  score
0   Mark   33   91.3
1   Jane   32   83.4
2  Chris   44   77.5
3   Ryan   42   87.7

In [5]:
# 합 구하기
print(df.sum())

name     MarkJaneChrisRyan
age                    151
score                339.9
dtype: object

In [6]:
# 평균 구하기
print(df.mean())

age      37.750
score    84.975
dtype: float64

C:\Users\soldesk\AppData\Local\Temp\ipykernel_7472\2807316344.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(df.mean())

In [9]:
# 해당 컬럼에 맞는 값만 추출할 수도 있다.
print([df.age])
print(df.age)
print(df['age'])

[0    33
1    32
2    44
3    42
Name: age, dtype: int64]
0    33
1    32
2    44
3    42
Name: age, dtype: int64
0    33
1    32
2    44
3    42
Name: age, dtype: int64

- apt csv 활용

In [21]:
df = pd.read_csv('apt.csv', encoding='cp949')
print(len(df))

32500

In [13]:
print(df.tail())

                 지역         아파트       면적   층      가격
32495  충청북도 충주시 호암동        호반현대  84.9600   7  18,500
32496  충청북도 충주시 호암동       호암동수채  84.9289   6  25,200
32497  충청북도 충주시 호암동  호암리버빌(1단지)  84.6800   6  22,900
32498  충청북도 충주시 호암동     호암힐데스하임  99.8000  13  46,000
32499  충청북도 충주시 호암동     호암힐데스하임  99.8700  24  50,000

In [12]:
print(df.head())

           지역          아파트        면적   층      가격
0  강원도 강릉시 교동  강릉교동롯데캐슬1단지  135.1727   4  59,000
1  강원도 강릉시 교동  강릉교동롯데캐슬2단지  135.1008   9  51,500
2  강원도 강릉시 교동        교동1주공   59.8900  12  23,200
3  강원도 강릉시 교동        교동3주공   59.8600  10  27,000
4  강원도 강릉시 교동        교동3주공   59.7900   4  26,000

In [14]:
print(df.지역.tail())

32495    충청북도 충주시 호암동
32496    충청북도 충주시 호암동
32497    충청북도 충주시 호암동
32498    충청북도 충주시 호암동
32499    충청북도 충주시 호암동
Name: 지역, dtype: object

In [16]:
print(df[df.면적 > 130])

                   지역          아파트        면적   층      가격
0          강원도 강릉시 교동  강릉교동롯데캐슬1단지  135.1727   4  59,000
1          강원도 강릉시 교동  강릉교동롯데캐슬2단지  135.1008   9  51,500
45        강원도 강릉시 입암동       이안강릉타운  157.3400   3  43,000
443       강원도 원주시 단계동        라이프타운  134.7600   7  22,000
479       강원도 원주시 단구동           두산  134.9700   7  20,000
...               ...          ...       ...  ..     ...
32199  충청북도 청주흥덕구 비하동  청주비하계룡리슈빌2차  155.3889   1  45,000
32232  충청북도 청주흥덕구 신봉동         삼정백조  203.1600   1  27,000
32385    충청북도 충주시 연수동      연수힐스테이트  143.2109   9  44,000
32388    충청북도 충주시 연수동       유원하나1차  130.9050  12  21,000
32474    충청북도 충주시 칠금동           삼일  215.3500   7  28,600

[854 rows x 5 columns]

In [20]:
df[df.면적 > 150]

                   지역           아파트        면적   층       가격
45        강원도 강릉시 입암동        이안강릉타운  157.3400   3   43,000
955    강원도 춘천시 동면 만천리        한일유앤아이  166.5906   7   39,000
1000      강원도 춘천시 석사동       현진에버빌2차  153.5700   6   59,500
1673   경기도 고양일산동구 식사동     위시티블루밍3단지  218.6600  20  140,000
1687   경기도 고양일산동구 식사동    위시티일산자이2단지  238.9914  16  121,000
...               ...           ...       ...  ..      ...
31360  충청북도 청주상당구 용담동  가좌마을용담이-편한세상  167.5642   5   44,500
31574  충청북도 청주서원구 분평동            보성  156.7400   3   19,300
32199  충청북도 청주흥덕구 비하동   청주비하계룡리슈빌2차  155.3889   1   45,000
32232  충청북도 청주흥덕구 신봉동          삼정백조  203.1600   1   27,000
32474    충청북도 충주시 칠금동            삼일  215.3500   7   28,600

[279 rows x 5 columns]

In [23]:
print(df.가격[(df.면적 > 130) & (df.가격 < 15000)])

29200    14300
29256    10800
Name: 가격, dtype: int64

In [26]:
df.loc[:,['지역', '아파트', '가격']][df.가격 > 200000]

                    지역        아파트      가격
3801     경기도 성남분당구 백현동  판교푸르지오그랑블  360000
3981     경기도 성남분당구 정자동      분당파크뷰  320000
3982     경기도 성남분당구 정자동      분당파크뷰  290000
3983     경기도 성남분당구 정자동      분당파크뷰  250000
3984     경기도 성남분당구 정자동      분당파크뷰  220000
...                ...        ...     ...
22262    서울특별시 용산구 이촌동       한강맨숀  418000
22264  서울특별시 용산구 한강로3가      센트럴파크  300000
22265    서울특별시 용산구 한남동       한남더힐  270000
22413   서울특별시 중구 장충동1가   장충동라임카운티  260000
22424   서울특별시 중구 회현동1가   SK리더스뷰남산  270000

[219 rows x 3 columns]

In [27]:
df.iloc[55:60]

             지역    아파트     면적   층     가격
55  강원도 강릉시 입암동  입암6주공  59.99  12  18600
56  강원도 강릉시 입암동  입암6주공  49.62  12  13000
57  강원도 강릉시 입암동  입암6주공  49.62   4  12800
58  강원도 강릉시 입암동  입암6주공  59.99   9  16100
59  강원도 강릉시 입암동  입암6주공  59.99   9  16100

In [28]:
df['단가'] = df.가격 / df.면적

df.loc[:10, ['가격', '면적', '단가']]

       가격        면적          단가
0   59000  135.1727  436.478668
1   51500  135.1008  381.196854
2   23200   59.8900  387.376858
3   27000   59.8600  451.052456
4   26000   59.7900  434.855327
5   35000   84.7155  413.147535
6   20000   84.7200  236.071766
7    4800   53.1900   90.242527
8   19700   59.8400  329.211230
9    7400   41.1800  179.698883
10   7400   41.1800  179.698883

In [29]:
df.sort_values(by='가격').loc[:,('가격', '지역')]

           가격                지역
27536     650      전라북도 남원시 내척동
27672     750  전라북도 익산시 낭산면 용기리
31084     920  충청북도 증평군 도안면 화성리
27670    1000  전라북도 익산시 낭산면 용기리
27671    1000  전라북도 익산시 낭산면 용기리
...       ...               ...
20043  520000    서울특별시 강남구 압구정동
20041  545000    서울특별시 강남구 압구정동
20079  570000     서울특별시 강남구 청담동
21413  620000     서울특별시 서초구 반포동
20002  650000     서울특별시 강남구 도곡동

[32500 rows x 2 columns]

In [32]:
df.sort_values(by='가격', ascending=False).loc[:,('가격', '지역')]

           가격                지역
20002  650000     서울특별시 강남구 도곡동
21413  620000     서울특별시 서초구 반포동
20079  570000     서울특별시 강남구 청담동
20041  545000    서울특별시 강남구 압구정동
20043  520000    서울특별시 강남구 압구정동
...       ...               ...
27671    1000  전라북도 익산시 낭산면 용기리
27670    1000  전라북도 익산시 낭산면 용기리
31084     920  충청북도 증평군 도안면 화성리
27672     750  전라북도 익산시 낭산면 용기리
27536     650      전라북도 남원시 내척동

[32500 rows x 2 columns]

In [33]:
df[df.지역.str.find('강릉') > -1]

              지역           아파트        면적   층     가격          단가
0     강원도 강릉시 교동   강릉교동롯데캐슬1단지  135.1727   4  59000  436.478668
1     강원도 강릉시 교동   강릉교동롯데캐슬2단지  135.1008   9  51500  381.196854
2     강원도 강릉시 교동         교동1주공   59.8900  12  23200  387.376858
3     강원도 강릉시 교동         교동3주공   59.8600  10  27000  451.052456
4     강원도 강릉시 교동         교동3주공   59.7900   4  26000  434.855327
..           ...           ...       ...  ..    ...         ...
101  강원도 강릉시 홍제동        홍제푸르지오  105.7150   1  36000  340.538240
102  강원도 강릉시 홍제동      홍제한신휴플러스   84.5900  13  39000  461.047405
103  강원도 강릉시 회산동  강릉서희스타힐스리버파크   74.6787  15  32400  433.858650
104  강원도 강릉시 회산동  강릉서희스타힐스리버파크   84.8956   7  34700  408.737320
105  강원도 강릉시 회산동       힐스테이트강릉   74.9974  15  28000  373.346276

[106 rows x 6 columns]

In [34]:
dfF = df[df.지역.str.find('강릉') > -1]

dfF.mean()

C:\Users\soldesk\AppData\Local\Temp\ipykernel_7472\3074375966.py:3: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dfF.mean()

면적       64.886780
층         7.084906
가격    19421.698113
단가      286.858889
dtype: float64

In [35]:
# 컬럼 데이터 안에 자릿수(,) 표시가 있을 경우
# 데이터를 문자열로 받아온 후 , 표시를 빈문자열로 대체 / 변환

df.가격 = df.가격.str.replace(',', '').astype('int64')

AttributeError: Can only use .str accessor with string values!